#+STARTUP: indent show2levels
#+AUTHOR: Shun2439
#+EMAIL: Shun2439@duck.com
#+DATE: <2025-10-16 木>

#+OPTIONS: H:1 author:nil

** DONE [[https://alpacahack.com/daily/challenges/a-fact-of-CTF][a fact of CTF]]
CLOSED: [2025-12-29 月 08:41]

#+begin_src shell
  curl -OL https://alpacahack-prod.s3.ap-northeast-1.amazonaws.com/1703ffac-8c0c-4a2a-a8ff-bb11a932ed56/a-fact-of-CTF.tar.gz

  tar -xzf a-fact-of-CTF.tar.gz
#+end_src

#+NAME: solver
#+begin_src python :tangle solver.py :results output :exports both
  from sympy import factorint

  primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293]

  try:
      with open('a-fact-of-CTF/output.txt', 'r') as f:
          ct_hex = f.read().strip() # 余計な文字を取り除く

      # 10進数の整数に変換
      # デフォルトでは出力できない
      ct = int(ct_hex, 16)

      # 素因数分解
      # ct = 2**a * 3**b * 5**c ...
      # factorsは辞書型になる
      factors = factorint(ct)

      # 指数を文字列に変換
      flag = "".join(chr(factors[p]) for p in primes if p in factors)
      print(flag)
  except FileNotFoundError:
      print("File not found")
#+end_src

#+RESULTS: solver
: Alpaca{prime_factorization_solves_everything}

